# utilizando API da Selic para Capturar Dados

In [51]:
import pandas as pd
from datetime import date, timedelta

# Parametros para reduzir consulta e otimizar extração dos dados
hoje = date.today()  # ou date.today()
inicio = hoje - timedelta(days=365*10)

# URL da API da SELIC para conexão
url = (
    "https://api.bcb.gov.br/dados/serie/bcdata.sgs.11/dados"
    f"?formato=json&dataInicial={inicio.strftime('%d/%m/%Y')}"
    f"&dataFinal={hoje.strftime('%d/%m/%Y')}"
)

df_selic = pd.read_json(url) # 

print(df_selic.info())
print(df_selic.tail())
df_selic

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2508 entries, 0 to 2507
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    2508 non-null   object
 1   valor   2508 non-null   float64
dtypes: float64(1), object(1)
memory usage: 39.3+ KB
None
            data     valor
2503  22/09/2025  0.055131
2504  23/09/2025  0.055131
2505  24/09/2025  0.055131
2506  25/09/2025  0.055131
2507  26/09/2025  0.055131

            data     valor
0     30/09/2015  0.052531
1     01/10/2015  0.052531
2     02/10/2015  0.052531
3     05/10/2015  0.052531
4     06/10/2015  0.052531
...          ...       ...
2503  22/09/2025  0.055131
2504  23/09/2025  0.055131
2505  24/09/2025  0.055131
2506  25/09/2025  0.055131
2507  26/09/2025  0.055131

[2508 rows x 2 columns]

In [52]:
df_selic.drop_duplicates(keep='last', inplace=True) # remove as duplicadas do dataframe

In [53]:
# Inserindo colunas e dados no dataframe
data_extracao = date.today()
df_selic['data_extracao'] = data_extracao
df_selic['responsvel'] = "Robson"
df_selic.head()

         data     valor data_extracao responsvel
0  30/09/2015  0.052531    2025-09-27     Robson
1  01/10/2015  0.052531    2025-09-27     Robson
2  02/10/2015  0.052531    2025-09-27     Robson
3  05/10/2015  0.052531    2025-09-27     Robson
4  06/10/2015  0.052531    2025-09-27     Robson

In [54]:
# Teste de procura dentro do dataframe 

df_selic.loc[[0,20,70,90,100]]

           data     valor data_extracao responsvel
0    30/09/2015  0.052531    2025-09-27     Robson
20   29/10/2015  0.052531    2025-09-27     Robson
70   12/01/2016  0.052531    2025-09-27     Robson
90   11/02/2016  0.052531    2025-09-27     Robson
100  25/02/2016  0.052531    2025-09-27     Robson

In [56]:
# Testando valores da Selic com base em um parâmetro Exemplo <0.01

teste_preco = df_selic['valor'] < 0.01
print(type(teste_preco))
teste_preco

<class 'pandas.core.series.Series'>

0       False
1       False
2       False
3       False
4       False
        ...
2503    False
2504    False
2505    False
2506    False
2507    False
Name: valor, Length: 2508, dtype: bool

# Aplicação Aula prática Biblioteca Pandas

suponha, agora que você trabalha em uma loja que vende itens variados, por conta de um erro no sistema de venda, não mostra o valor unitário dos itens vendidos e existem algumas duplicações de linhas.  
você precisa mostrar os itens com valores acima de 50 reais para o planejamento de marketing....

In [62]:
# Criando o dataframe com os produtos.

dados = {
    'nome' : ['Produto A', 'Produto B', 'Produto C', 'Produto A', 'Produto E'],
    'qtd_comprada':[3, 1, 4, 3 ,2],
    'tipo_de_item': ['Eletrônico', 'Vestuário', 'Alimento', 'Eletrônico', 'Alimento'],
    'receita_total': [120, 80, 60, 120, 90]
    }

df = pd.DataFrame(dados)
df

        nome  qtd_comprada tipo_de_item  receita_total
0  Produto A             3   Eletrônico            120
1  Produto B             1    Vestuário             80
2  Produto C             4     Alimento             60
3  Produto A             3   Eletrônico            120
4  Produto E             2     Alimento             90

In [63]:
# Removendo Duplicatas

df.drop_duplicates(keep='last', inplace=True)
df

        nome  qtd_comprada tipo_de_item  receita_total
1  Produto B             1    Vestuário             80
2  Produto C             4     Alimento             60
3  Produto A             3   Eletrônico            120
4  Produto E             2     Alimento             90

In [79]:
# Calcular preço unitário do item

df['preco_item'] = df['receita_total'] / df['qtd_comprada'] # Inseri coluna com preço do item
df_acima_de_50_reais = df[df['preco_item'] >=50] # Filtra apenas itens acima de 50
df_acima_de_50_reais

        nome  qtd_comprada tipo_de_item  receita_total  preco_item
1  Produto B             1    Vestuário             80        80.0